###############################################################
#  Generated by:      Cadence Innovus 16.20-p002_1
#  OS:                Linux x86_64(Host ID joker.ece.northwestern.edu)
#  Generated on:      Sun Nov 23 18:31:23 2025
#  Design:            DNN
#  Command:           saveDesign DNN_conv_globalrouting_filler_perfect2.enc
###############################################################
current_design DNN
create_clock [get_ports {s_axi_aclk}]  -name s_axi_aclk -period 10.000000 -waveform {0.000000 5.000000}
set_propagated_clock  [get_ports {s_axi_aclk}]
set_max_capacitance 0.01  [get_ports {s_axi_aclk}]
set_max_capacitance 0.01  [get_ports {s_axi_aresetn}]
set_max_capacitance 0.01  [get_ports {axis_in_data[15]}]
set_max_capacitance 0.01  [get_ports {axis_in_data[14]}]
set_max_capacitance 0.01  [get_ports {axis_in_data[13]}]
set_max_capacitance 0.01  [get_ports {axis_in_data[12]}]
set_max_capacitance 0.01  [get_ports {axis_in_data[11]}]
set_max_capacitance 0.01  [get_ports {axis_in_data[10]}]
set_max_capacitance 0.01  [get_ports {axis_in_data[9]}]
set_max_capacitance 0.01  [get_ports {axis_in_data[8]}]
set_max_capacitance 0.01  [get_ports {axis_in_data[7]}]
set_max_capacitance 0.01  [get_ports {axis_in_data[6]}]
set_max_capacitance 0.01  [get_ports {axis_in_data[5]}]
set_max_capacitance 0.01  [get_ports {axis_in_data[4]}]
set_max_capacitance 0.01  [get_ports {axis_in_data[3]}]
set_max_capacitance 0.01  [get_ports {axis_in_data[2]}]
set_max_capacitance 0.01  [get_ports {axis_in_data[1]}]
set_max_capacitance 0.01  [get_ports {axis_in_data[0]}]
set_max_capacitance 0.01  [get_ports {axis_in_data_valid}]
set_load -pin_load -max  0.05  [get_ports {axis_in_data_ready}]
set_load -pin_load -min  0.05  [get_ports {axis_in_data_ready}]
set_load -pin_load -max  0.05  [get_ports {class_id[3]}]
set_load -pin_load -min  0.05  [get_ports {class_id[3]}]
set_load -pin_load -max  0.05  [get_ports {class_id[2]}]
set_load -pin_load -min  0.05  [get_ports {class_id[2]}]
set_load -pin_load -max  0.05  [get_ports {class_id[1]}]
set_load -pin_load -min  0.05  [get_ports {class_id[1]}]
set_load -pin_load -max  0.05  [get_ports {class_id[0]}]
set_load -pin_load -min  0.05  [get_ports {class_id[0]}]
set_load -pin_load -max  0.05  [get_ports {class_valid}]
set_load -pin_load -min  0.05  [get_ports {class_valid}]
set_load -pin_load -max  0.05  [get_ports {VDD}]
set_load -pin_load -min  0.05  [get_ports {VDD}]
set_load -pin_load -max  0.05  [get_ports {VSS}]
set_load -pin_load -min  0.05  [get_ports {VSS}]
set_max_fanout 40  [get_designs {DNN}]
set_max_transition 0.07  [get_designs {DNN}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[14]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[14]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[12]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[12]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[10]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[10]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data_valid}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data_valid}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[9]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[9]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[7]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[7]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[5]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[5]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[3]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[3]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[1]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[1]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[15]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[15]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[13]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[13]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[11]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[11]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[8]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[8]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[6]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[6]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[4]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[4]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[2]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[2]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[0]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[0]}]
set_output_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {class_id[0]}]
set_output_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {class_id[0]}]
set_output_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data_ready}]
set_output_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data_ready}]
set_output_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {class_id[3]}]
set_output_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {class_id[3]}]
set_output_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {class_id[1]}]
set_output_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {class_id[1]}]
set_output_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {class_valid}]
set_output_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {class_valid}]
set_output_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {class_id[2]}]
set_output_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {class_id[2]}]
set_clock_uncertainty 0.2 -hold [get_clocks {s_axi_aclk}]
set_clock_uncertainty 0.5 -setup [get_clocks {s_axi_aclk}]
set_false_path  -from [get_ports {s_axi_aresetn}] 
